In [1]:
import numpy as np

In [3]:
import pandas as pd

In [26]:
df = pd.read_csv("C:/Users/Student/Documents/Study/Maths_&_statistics/income.csv", names = ["name", "income"], skiprows=[0])
df

        name    income
0        Rob      5000
1      Rafiq      6000
2       Nina      4000
3      Sofia      7500
4      Mohan      8000
5        Tao      7000
6  Elon Musk  10000000

In [9]:
df.describe()

             income
count  7.000000e+00
mean   1.433929e+06
std    3.777283e+06
min    4.000000e+03
25%    5.500000e+03
50%    7.000000e+03
75%    7.750000e+03
max    1.000000e+07

In [15]:
#Qunatile: min value(5 point summary)
df.income.quantile(0)

4000.0

In [11]:
#Qunatile-1(Q1)=>25%
df.income.quantile(0.25)

5500.0

In [13]:
#Qunatile-2(median)=>50%
df.income.quantile(0.50)

7000.0

In [12]:
#Qunatile-3(Q3)=>75%
df.income.quantile(0.75)

7750.0

In [14]:
#IQR = Q3-Q1
#Qunatile: max value(5 point summary)
df.income.quantile(1)

10000000.0

In [18]:
df.income.quantile(0.99)

9400479.999999994

### 1. To remove the outlier
(in this table the outlier is 6	Elon Musk	10000000)

In [19]:
p_99 = df.income.quantile(0.99)
p_99

9400479.999999994

In [20]:
df[df.income>p_99]   #outlier

        name    income
6  Elon Musk  10000000

In [21]:
##removing outlier from the table
df_no_outlier = df[df.income<=p_99]
df_no_outlier

    name  income
0    Rob    5000
1  Rafiq    6000
2   Nina    4000
3  Sofia    7500
4  Mohan    8000
5    Tao    7000

## 2. Filling a missing value

In [27]:
df

        name    income
0        Rob      5000
1      Rafiq      6000
2       Nina      4000
3      Sofia      7500
4      Mohan      8000
5        Tao      7000
6  Elon Musk  10000000

In [28]:
df['income'][3] = np.NaN

C:\Users\Student\AppData\Local\Continuum\anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.
C:\Users\Student\AppData\Local\Continuum\anaconda3\lib\site-packages\pandas\core\indexing.py:1732: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_single_block(indexer, value, name)

In [30]:
df

        name      income
0        Rob      5000.0
1      Rafiq      6000.0
2       Nina      4000.0
3      Sofia         NaN
4      Mohan      8000.0
5        Tao      7000.0
6  Elon Musk  10000000.0

In [31]:
df.income.mean()  #it is high due to the outlier

1671666.6666666667

If we use mean here to fill the missing value then it will not appropriate and resonable data as this is quite high value due to outlier and not justifiable to other data values as well so instead of that we should use median as it is not affected by any outlier

In [32]:
df_new = df.fillna(df.median())
df_new

C:\Users\Student\AppData\Local\Continuum\anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  """Entry point for launching an IPython kernel.

        name      income
0        Rob      5000.0
1      Rafiq      6000.0
2       Nina      4000.0
3      Sofia      6500.0
4      Mohan      8000.0
5        Tao      7000.0
6  Elon Musk  10000000.0